
$('select.dropdown').dropdown();
$('.selection.dropdown').dropdown();

$('.ui.form').form({
    inline: true,
    onFailure () {
        setTimeout(() => {
            // 获取第一个错误位置
            const res = $('.field.error')[0].getBoundingClientRect();
            const top = document.scrollingElement.scrollTop + res.y;
            // 此处有一个疑惑点 为何需要 -120 目前没有深入研究
            $(document.scrollingElement).scrollTop(top - 120)
        }, 16)
        return false;
    },
    onSuccess() {
        return true;
    },
    fields: {
        gender: {
            identifier: 'gender',
            rules: [
                {
                    type: 'empty',
                    prompt: '请输入您的性别'
                }
            ]
        },
        name: {
            identifier: 'name',
            rules: []
        },
        education: {
            identifier: 'education',
            rules: [
                {
                    type: 'empty',
                    prompt: '请输入您的学历'
                }
            ]
        },
        age: {
            identifier: 'age',
            rules: [
                {
                    type: 'empty',
                    prompt: '请输入您的年龄'
                }
            ]
        },
        q1: {
            identifier: 'q1',
            rules: [
                {
                    type: 'empty',
                    prompt: '请选择否玩过电子游戏'
                }
            ]
        },
        q2: {
            identifier: 'q2',
            rules: [
                {
                    type: 'empty',
                    prompt: '请选择平均频率'
                }
            ]
        },
        q3: {
            identifier: 'q3',
            rules: [
                {
                    type: 'minCount[1]',
                    prompt: '请选择喜欢游玩电子游戏的类型'
                }
            ]
        },
        q4: {
            identifier: 'q4',
            rules: [
                {
                    type: 'empty',
                    prompt: '请选择玩游戏的目的'
                }
            ]
        },
        q5: {
            identifier: 'q5',
            rules: [
                {
                    type: 'empty',
                    prompt: '请选择如何看待游戏收费'
                }
            ]
        },
        q6: {
            identifier: 'q6',
            rules: [
                {
                    type: 'empty',
                    prompt: '请选择如何看待盗版/破解游戏'
                }
            ]
        },
        q7: {
            identifier: 'q7',
            rules: [
                {
                    type: 'empty',
                    prompt: '请选择是否觉得游戏时长应该被限制'
                }
            ]
        },
        q8: {
            identifier: 'q8',
            rules: [
                {
                    type: 'empty',
                    prompt: '请选择是否觉得游戏影响了你的生活'
                }
            ]
        },
        q9: {
            identifier: 'q9',
            rules: [
                {
                    type: 'empty',
                    prompt: '请选择是否认为游戏是导致学生成绩下滑的主要原因'
                }
            ]
        },
        q10: {
            identifier: 'q10',
            rules: [
                {
                    type: 'empty',
                    prompt: '请选择是否能自觉控制游戏时长'
                }
            ]
        }
        }
});

$('#randomNameBtn').on('click', (e) => {
    e.preventDefault()

    let name
    let JPorZH = Math.random() > 0.9
    if (JPorZH)
        name = randomJapaneseName()
    else
        name = randomChineseName()

    $('#name-input').val(name)
})

function randomJapaneseName() {
    let lastName = ['鹿目', '美树', '佐仓', '巴)(麻', '百江',
        '上条', '志筑', '早乙女', '晓美', '白井', '御坂', '一方',
        '食蜂', '初春', '天井', '佐天', '土御门', '月咏', '风斩', '固法', '冥土',
        '乌间', '伊莉娜·', '雪村', '片冈', '前原', '冈野', '矶贝', '仓桥阳', '木村', '茅野', '潮田', '中村',
        '三村', '矢田', '竹林', '不破', '杉野', '速水', '冈岛', '神崎', '吉田', '原寿', '菅谷',
        '奥田', '千叶', '狭间', '村松', '赤羽', '堀部', '寺坂', '木之本', '大道寺', '月城',
        '冈部', '凤凰院', '椎名', '桥田', '牧濑', '桐生', '漆原', '菲伊', '阿万音', '比屋定'
    ]
    let firstName = ['圆', '沙耶香', '杏子', '美', '渚', '恭介',
        '仁美', '和子', '达也', '知久', '焰', '黑子', '美琴', '通行',
        '操祈', '饰利', '亚雄', '泪子', '当麻', '元春', '小萌', '冰华', '美伟', '追魂',
        '惟臣', '耶拉维琪', '亚久里', '惠', '阳斗', '日向', '悠马', '菜乃', '正义', '枫', '莉樱',
        '航辉', '桃花', '孝太郎', '优月', '友人', '凛香', '大河', '有希子', '大成', '美铃', '创介',
        '爱美', '龙之介', '绮罗罗', '拓哉', '律', '业', '糸成', '龙马', '樱', '桃矢', '知世', '雪兔',
        '伦太郎', '凶真', '真由理', '至', '红莉栖', '萌郁', '琉华', '丽丝', '铃羽', '真帆', '篝', '由季', '莉可', '雷格'
    ]
    return randomItem(lastName) + randomItem(firstName)
}

function randomChineseName() {
    const lastNames = ['赵', '钱', '孙', '李', '周', '吴', '郑', '王', '肖', '蔡', '冯', '陈',
        '褚', '卫', '蒋', '沈', '韩', '杨', '朱', '秦', '尤', '何', '吕',
        '施', '张', '孔', '曹', '严', '华', '魏', '陶', '姜', '戚', '谢',
        '邹', '喻', '柏', '水', '窦', '章', '云', '苏', '潘', '葛', '奚', '范', '彭',
        '郎', '鲁', '韦', '昌', '马', '苗', '凤', '俞', '任', '袁', '柳', '酆',
        '鲍', '史', '唐', '费', '廉', '岑', '薛', '雷', '贺', '倪', '汤', '滕', '殷', '罗', '毕',
        '郝', '邬', '安', '常', '乐', '于', '时', '傅', '皮', '卞', '齐', '康', '伍', '余', '元', '卜',
        '顾', '孟', '平', '和', '穆', '萧', '尹', '欧阳', '段', '黎', '龙',
        '舒', '金', '游', '童', '喜', '胡', '石', '南', '宫',
        '程', '徐', '陆', '宇', '詹', '贾', '夏', '池', '来', '甘', '勾', '苟',
        '饶', '管', '许', '家', '巴', '祁', '厉', '郏', '班', '仰', '秋', '伊', '禹', '庄', '瞿', '骆',
        '胥', '闵', '丰', '简', '花', '区', '乌', '盖', '督', '岳', '帅', '缑', '亢', '况',
        '后', '有', '琴', '公', '号', '井', '米', '集', '富', '贵', '冈', '但', '车', '终', '究', '翟', '边', '阮', '靳',
        '东', '欧', '桓', '明', '凌', '红', '官', '运', '须', '叶', '盛', '巩', '亓', '示', '智',
        '诸', '赵', '伏', '邢', '晋', '郁', '昝', '端', '敖', '融', '冷', '訾', '辛', '阚', '那', '宗', '翁', '关', '相',
        '查', '荆', '竺', '权', '逯', '益', '万', '俟', '马', '上官',
        '侯', '葛', '闻', '东方', '赫', '连', '皇甫', '尉', '迟', '羊', '澹', '台', '治',
        '政', '濮', '阳', '淳', '单', '太叔', '申屠', '公孙', '管仲', '孙', '轩辕', '令狐', '钟',
        '离', '文', '长孙', '慕容', '鲜', '闾', '丘', '司徒', '空', '司', '寇', '仉']

    const middleNames = ['子', '安', '一', '徐', '梦', '思', '语', '宇', '悠', '伊', '芷', '如', '凡', '芳',
        '千', '语', '春', '秋', '夏', '冬', '雨', '霖', '梅', '柳', '雪', '霜', '霞', '彤', '琴',
        '瑶', '婉', '娴', '妍', '嫣', '燕', '琳', '露', '莹', '艳', '婷', '晴', '雁', '瑾', '蓉', '菲',
        '妮', '娅', '菁', '姗', '涵', '映', '晶', '若', '娜', '馨', '曼', '然', '琪', '妤', '宁', '凌', '宸',
        '荣', '蕾', '涓', '雯', '雨', '婷', '悦', '巧', '蓓', '舒', '萍', '晨', '夕', '夜', '朝', '之', '不',
        '乐', '有', '心', '希', '望', '向', '前', '寒', '暖', '自', '知', '静', '深', '宽', '广', '大', '博',
        '文', '亮', '明', '鹏', '飞', '中', '庸', '义', '翔', '皓', '星', '月', '云', '彩', '灵', '秀', '千',
        '寻', '梦', '蔚', '伟', '荣', '阳', '晖', '明', '俊', '达', '勇', '杰', '卓', '寒', '凝', '宇', '洁',
        '雨', '霖', '晨', '韵', '鸿', '畅', '卫', '俊', '林', '毅', '霖', '昱', '晨', '梓', '凡', '嘉', '懿',
        '晨', '曦', '阳', '晨', '映', '鑫', '亮', '致', '远', '博', '瑞', '泽', '绍', '元', '震', '荣', '伟',
        '弘', '涛', '炎', '榆', '良', '昌', '龙', '高', '飞', '航', '运', '振', '兴', '福', '智', '霖', '宇',
        '轩', '辰', '逸', '翔', '泽', '鑫', '良', '辰', '添', '福', '承', '望', '庆', '余', '德', '慧', '润',
        '良', '春', '婧', '宸', '慧', '宇', '凯', '悦', '青', '清', '和', '涵', '梦', '童', '鸣', '晨', '凝',
        '梦', '庭', '婧', '善', '莹', '泽', '晴', '晨', '雨', '希', '轩', '涵', '思', '茜', '轩', '霖', '彬',
        '博', '涛', '宏', '慈', '睿', '淑', '茹', '晨', '旭', '昱', '恩', '宸', '竹', '梓', '涵', '思', '莹',
        '洁', '宇', '智', '宸', '瑞', '茜', '祥', '彬', '凡', '艺', '凯', '伦', '杨', '宁', '钰', '涛', '坤',
        '琳', '明', '亮', '怡', '菲', '俊', '俏', '宇', '翔', '晓', '雅', '韵', '涵', '丽', '霖', '婷', '晨']

    const firstNames = ['宇', '瑜', '琦', '彬', '伟', '涛', '宏', '鑫', '旭', '翔', '峰', '洋', '阳', '炎', '杰',
        '军', '强', '良', '昌', '龙', '豪', '晨', '轩', '辰', '炳', '远', '亮', '煜', '阳', '阳', '琪', '勇', '星', '凯', '坤',
        '椿', '亚', '梦', '安', '科', '昌', '费', '清', '风', '明', '团', '政', '博', '光', '关', '吉', '经', '统', '仁', '桓',
        '煋', '情', '单', '天', '地', '源', '远', '彼', '岸', '山', '善', '和', '辽', '或', '迪', '江', '祝', '台', '信', '幸',
        '瑞', '睿', '稳', '多', '一', '温', '凤', '婚', '礼', '还', '候', '赞', '达', '旦', '出', '肖', '啸', '晓', '忠', '重',
        '良', '缉', '剑', '赤', '迟', '柯', '基', '克', '南', '北', '东', '奇', '希', '来', '熙', '至', '望', '联', '想', '莽', '四',
        '似', '是', '伦', '杰', '冉', '品', '剖', '解', '浩', '泽', '否', '非', '定', '时', '班', '坂', '戈', '肯', '曲', '金', '德', '双',
        '俊', '峻', '祥', '泽', '昊', '辉', '德', '庆', '坤', '豪', '栋', '源', '辰', '振', '翰', '彪', '兴', '福',
        '美', '宁', '媛', '琳', '露', '洁', '彤', '玥', '蓉', '菲', '娜', '艺', '涵', '慧', '琪',
        '妍', '婷', '萍', '璐', '薇', '瑾', '茜', '霞', '榆', '莎', '雯', '希', '梦', '怡', '静', '馨', '曼', '丽',
        '悦', '舒', '娟', '瑶', '若', '晴', '蕾', '艳', '倩', '妮', '雨', '欣', '婕', '楠'];

    let nm = randomItem(middleNames)
    if (Math.random() > 0.85)
        nm = ''

    return randomItem(lastNames) + nm + randomItem(firstNames)
}

function randomItem(list) {
    return list[Math.round(Math.random() * (list.length - 1))]
}

$(document).ready(function() {

    window.genderText = '少年/少女'

    setInterval(() => {
        $('title').text('都' +
            new Date().getFullYear().toString().split('').reverse().join('') +
            '年了还有人玩魔圆的梗吧')
    }, 2000)

    new TypeIt('#sign', {
        speed: 100,
        startDelay: 900,
        waitUntilVisible: true,
        loop: true
    })
        .type('感谢抽出宝贵的时间帮助我们完成此问卷调查 <br> 祝工作顺利, 生活愉快', { delay: 1000 })
        .pause(200)
        .delete(100)
        .type('<s>' + window.genderText +'</s>', { delay: 500 })
        .pause(200)
        .type('<s>,与我</s>', { delay: 500 })
        .pause(200)
        .type('<s>签订契约</s>', { delay: 500 })
        .pause(200)
        .type('<s>成为</s>', { delay: 500 })
        .pause(200)
        .type('<s>马猴烧酒</s>', { delay: 500 })
        .pause(500)
        .delete(4)
        .type('<s>魔法少女</s>', { delay: 500 })
        .pause(200)
        .type('<s>吧</s>', { delay: 500 })
        .go()
})

function onGenderMale() {
    window.genderText = '少年'
}

function onGenderFemale() {
    window.genderText = '少女'

}

function onGenderCat() {
    window.genderText = '少年/少女'
}




let nfnf = location.hash.replace("#", "")

$.get("whiterasbk.top:8888/qs/" + nfnf, (data, status) => {
    let df = eval(data + '')
    $("#name-input").val(df.name)
})